Revit 2024 API
PipePressureDropData Class
 The input and output data used by external servers for calculation of the pipe pressure drop.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class PipePressureDropData : IDisposable
Visual Basic
Public Class PipePressureDropData _
	Implements IDisposable
Visual C++
public ref class PipePressureDropData : IDisposable
Remarks
 Roughness, Length, Flow, Diameter, Density, and Viscosity field values are input data for the calculation. ReynoldsNumber, FlowStatus, Friction, FrictionFactor, Velocity, Coefficient, and PressureDrop are output values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipePressureDropData
See Also
PipePressureDropData Members
Autodesk.Revit.DB.Plumbing Namespace